//          === Работа с if-else ===
/* 1. Если переменная a равна нулю, то выведите 'Верно', иначе
выведите 'Неверно'. Проверьте работу скрипта при a, равном
1, 0, -3. */
// let a = 0;
// let result = a === 0 ? "Верно" : "Неверно";
// console.log(result);

/* 2. Если переменная a больше нуля, то выведите 'Верно', иначе
выведите 'Неверно'. Проверьте работу скрипта при a, равном
1, 0, -3. */
// let a = 1;
// let result = typeof a === "number" && a > 0 ? "Верно" : "Неверно";
// console.log(result);

/* 3. Если переменная a меньше нуля, то выведите 'Верно', иначе
выведите 'Неверно'. Проверьте работу скрипта при a, равном
1, 0, -3. */
// let a = -3;
// let result = typeof a === "number" && a < 0 ? "Верно" : "Неверно";
// console.log(result);

/* 4. Если переменная a больше или равна нулю, то выведите
'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта
при a, равном 1, 0, -3. */
// let a = -3;
// let result = typeof a === "number" && a >= 0 ? "Верно" : "Неверно";
// console.log(result);

/* 5. Если переменная a меньше или равна нулю, то выведите
'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта
при a, равном 1, 0, -3. */
// let a = 0;
// let result = typeof a === "number" && a <= 0 ? "Верно" : "Неверно";
// console.log(result);

/* 6. Если переменная a не равна нулю, то выведите 'Верно', иначе
выведите 'Неверно'. Проверьте работу скрипта при a, равном
1, 0, -3. */
let a = 1;
let result = a !== 0 ? "Верно" : "Неверно";
console.log(result);
