/* 1. Простые данные
Задача: В переменной хранится возраст пользователя. Ему может быть 0 лет.
Как назвать переменную? */
let userAge = 0;

/* 2. Флаги состояния
Задача: Нужно отслеживать, авторизован ли пользователь на сайте.
Как назвать переменную? */
let isAuthorised = false; // Можно более конкретно назвать перменную isAuthorizedUser

/* 3. Коллекции элементов
Задача: В переменной хранится список всех товаров в корзине интернет-магазина.
Как назвать переменную? */
let cartItems = ["apple", "banana", "orange"];
